app/views/restaurants/_newform.html.erb

SELECT "restaurants".* FROM "restaurants"
---
     Restaurant name :
        <%= select_tag(:restaurant_name, options_for_select(Restaurant.all.map { |city| [city.restaurant_name, city.id] })) %>