app/views/restaurants/_restaurantslist.html.erb

    <% @restaurants.each do |restaurant| %>
    <% restaurant.menu.each do |menu| %>
---
SELECT "menus".* FROM "menus" WHERE "menus"."restaurant_id" = ?  [["restaurant_id", 1]]