app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE (id = '1')
SELECT COUNT(*) FROM "restaurants" WHERE (id = '1')
---
  def search_by_restaurant
    search_string = params[:restaurant_name]
    puts params[:restaurant_name]
    @restaurants = Restaurant.search (search_string)
     if (@restaurants.size ==0 || @restaurants == nil )

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? ORDER BY "restaurants"."id" ASC LIMIT 1  [["id", 1]]
---
    def set_restaurant
      @restaurant = Restaurant.find(params[:id])