app/controllers/users_controller.rb

  def create
    @user = User.new(devise_registrations_permitted_parameters)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "password_hash", "password_salt", "updated_at") VALUES (?, ?, ?, ?, ?)