app/controllers/user_infos_controller.rb

SELECT "user_infos".* FROM "user_infos" WHERE "user_infos"."user_id" = 1 LIMIT 1
---
  def view
    @gender = UserInfo.get_gender
    @height = UserInfo.get_height
    @weight = UserInfo.get_weight
    @user_info = UserInfo.find_by(:user_id=>params[:id])

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT 1
INSERT INTO "user_infos" ("created_at", "dob", "first_name", "gender", "height", "last_name", "updated_at", "user_id", "weight") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user_info = UserInfo.new(user_info_params)
    @user_id = User.last.id
    @user_info.user_id =  @user_id
    @gender = UserInfo.get_gender
    @height = UserInfo.get_height
    @weight = UserInfo.get_weight
    respond_to do |format|
       @user_infos = UserInfo.all
      if @user_info.save

SELECT "user_infos".* FROM "user_infos" WHERE "user_infos"."id" = ? LIMIT 1  [["id", "5"]]
---
    def set_user_info
      @user_info = UserInfo.find(params[:id])